ZhuYanzhen1/CH32V307/ch32v307.svd
				<resetValue>0x20</resetValue>
				<fields>
					<field>
						<name>RB_UIF_BUS_RST</name>
						<description>RB_UIF_BUS_RST</description>
						<bitRange>[0:0]</bitRange>
            <access>read-write</access>
					</field>
					<field>
						<name>RB_UIF_TRANSFER</name>
						<description>USB transfer completion interrupt flag, direct bit address clear or write 1 to clear</description>
						<bitRange>[1:1]</bitRange>
            <access>read-write</access>
					</field>
					<field>
						<name>RB_UIF_SUSPEND</name>
						<description>USB suspend or resume event interrupt flag, direct bit address clear or write 1 to clear</description>
						<bitRange>[2:2]</bitRange>
            <access>read-write</access>
					</field>
					<field>
						<name>RB_UIF_HST_SOF</name>
						<description>host SOF timer interrupt flag for USB host, direct bit address clear or write 1 to clear</description>
						<bitRange>[3:3]</bitRange>
            <access>read-write</access>
					</field>
					<field>
						<name>RB_UIF_FIFO_OV</name>
						<description>FIFO overflow interrupt flag for USB, direct bit address clear or write 1 to clear</description>
						<bitRange>[4:4]</bitRange>
            <access>read-write</access>
					</field>
					<field>
						<name>RB_U_SETUP_ACT</name>
						<description>USB_SETUP_ACT</description>
						<bitRange>[5:5]</bitRange>
						<access>read-write</access>
					</field>
					<field>
						<name>UIF_ISO_ACT</name>
						<description>UIF_ISO_ACT</description>
						<bitRange>[6:6]</bitRange>
						<access>read-write</access>
					</field>
					<field>
						<name>RB_U_IS_NAK</name>
						<description>RO, indicate current USB transfer is NAK received</description>
						<bitRange>[7:7]</bitRange>
						<access>read-only</access>
					</field>
				</fields>
			</register>
			<register>
				<name>USB_INT_ST</name>
				<description>USB interrupt status</description>
				<addressOffset>0x0B</addressOffset>
				<size>8</size>
				<access>read-only</access>
				<fields>
					<field>
						<name>MASK_UIS_H_RES__MASK_UIS_ENDP</name>
						<description>RO, bit mask of current transfer handshake response for USB host mode: 0000=no response, time out from device, others=handshake response PID received;RO, bit mask of current transfer endpoint number for USB device mode</description>
						<bitRange>[3:0]</bitRange>
					</field>
					<field>
						<name>MASK_UIS_TOKEN</name>
						<description>RO, bit mask of current token PID code received for USB device mode</description>
						<bitRange>[5:4]</bitRange>
					</field>
					<field>
						<name>RB_UIS_TOG_OK</name>
						<description>RO, indicate current USB transfer toggle is OK</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UIS_IS_NAK</name>
						<description>RO, indicate current USB transfer is NAK received for USB device mode</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>USB_RX_LEN</name>
				<description>USB receiving length</description>
				<addressOffset>0x0C</addressOffset>
				<size>16</size>
				<access>read-only</access>
        <fields>
          <field>
            <name>R16_USB_RX_LEN</name>
						<description>length of received bytes</description>
						<bitRange>[15:0]</bitRange>
          </field>
        </fields>
			</register>
			<register>
				<name>UEP_CONFIG</name>
				<description>USB endpoint configuration</description>
				<addressOffset>0x10</addressOffset>
				<size>0X20</size>
				<access>read-write</access>
			<fields>
			<field>
            <name>bUEP_R_EN__UH_EP_MOD</name>
						<description>endpoint RX enable/bUH_TX_EN</description>
						<bitRange>[31:16]</bitRange>
						<access>read-write</access>
			</field>
		    <field>
            <name>bUEP_T_EN/bUH_TX_EN</name>
						<description>endpoint TX enable/bUH_TX_EN</description>
						<bitRange>[15:0]</bitRange>
						<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
				<name>UEP_TYPE</name>
				<description>USB endpoint type</description>
				<addressOffset>0x14</addressOffset>
				<size>0X20</size>
				<access>read-write</access>
			<fields>
			<field>
            <name>bUEP_R_TYPE</name>
						<description>endpoint RX type</description>
						<bitRange>[31:16]</bitRange>
						<access>read-write</access>
			</field>
		    <field>
            <name>bUEP_T_TYPE</name>
						<description>endpoint TX type</description>
						<bitRange>[15:0]</bitRange>
						<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
				<name>UEP_BUF_MOD</name>
				<description>USB endpoint buffer mode</description>
				<addressOffset>0x18</addressOffset>
				<size>0X20</size>
				<access>read-write</access>
			<fields>
			<field>
            <name>bUEP_ISO_BUF_MOD</name>
						<description>buffer mode of USB endpoint</description>
						<bitRange>[31:16]</bitRange>
						<access>read-write</access>
			</field>
		    <field>
            <name>bUEP_BUF_MOD</name>
						<description>buffer mode of USB endpoint</description>
						<bitRange>[15:0]</bitRange>
						<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
				<name>UEP0_DMA</name>
				<description>B endpoint 0 DMA buffer address</description>
				<addressOffset>0x1C</addressOffset>
				<size>16</size>
				<access>read-write</access>
			<fields>
			<field>
            <name>UEP0_DMA</name>
					<description> endpoint 0 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP1_RX_DMA</name>
			<description>endpoint 1 DMA RX buffer address</description>
			<addressOffset>0x20</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP1_RX_DMA</name>
					<description> endpoint 1 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP2_RX_DMA__UH_RX_DMA</name>
			<description>endpoint 2 DMA RX buffer address/UH_RX_DMA</description>
			<addressOffset>0x24</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP2_RX_DMA__UH_RX_DMA</name>
					<description> endpoint 2 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP3_RX_DMA</name>
			<description>endpoint 3 DMA RX buffer address</description>
			<addressOffset>0x28</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP3_RX_DMA</name>
					<description> endpoint 3 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP4_RX_DMA</name>
			<description>endpoint 4 DMA RX buffer address</description>
			<addressOffset>0x2C</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP4_RX_DMA</name>
					<description> endpoint 4 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP5_RX_DMA</name>
			<description>endpoint 5 DMA RX buffer address</description>
			<addressOffset>0x30</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP5_DMA</name>
					<description> endpoint 5 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP6_RX_DMA</name>
			<description>endpoint 6 DMA RX buffer address</description>
			<addressOffset>0x34</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP6_RX_DMA</name>
					<description> endpoint 6 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP7_RX_DMA</name>
			<description>endpoint 7 DMA RX buffer address</description>
			<addressOffset>0x38</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP7_RX_DMA</name>
					<description> endpoint 7 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP8_RX_DMA</name>
			<description>endpoint 8 DMA RX buffer address</description>
			<addressOffset>0x3C</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP8_RX_DMA</name>
					<description> endpoint 8 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP9_RX_DMA</name>
			<description>endpoint 9 DMA RX buffer address</description>
			<addressOffset>0x40</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP9_RX_DMA</name>
					<description> endpoint 9 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP10_RX_DMA</name>
			<description>endpoint 10 DMA RX buffer address</description>
			<addressOffset>0x44</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP10_RX_DMA</name>
					<description> endpoint 10 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP11_RX_DMA</name>
			<description>endpoint 11 DMA RX buffer address</description>
			<addressOffset>0x48</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP11_RX_DMA</name>
					<description> endpoint 11 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>

			<register>
			<name>UEP12_RX_DMA</name>
			<description>endpoint 12 DMA RX buffer address</description>
			<addressOffset>0x4C</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP12_RX_DMA</name>
					<description> endpoint 12 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP13_RX_DMA</name>
			<description>endpoint 13 DMA RX buffer address</description>
			<addressOffset>0x50</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP13_RX_DMA</name>
					<description> endpoint 13 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP14_RX_DMA</name>
			<description>endpoint 14 DMA RX buffer address</description>
			<addressOffset>0x54</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP14_RX_DMA</name>
					<description> endpoint 14 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP15_RX_DMA</name>
			<description>endpoint 15 DMA RX buffer address</description>
			<addressOffset>0x58</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP15_RX_DMA</name>
					<description> endpoint 15 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP1_TX_DMA</name>
			<description>endpoint 1 DMA TX buffer address</description>
			<addressOffset>0X5C</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP1_TX_DMA</name>
					<description> endpoint 1 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP2_TX_DMA</name>
			<description>endpoint 2 DMA TX buffer address</description>
			<addressOffset>0x60</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP2_TX_DMA</name>
					<description> endpoint 2 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP3_TX_DMA__UH_TX_DMA</name>
			<description>endpoint 3 DMA TX buffer address</description>
			<addressOffset>0x64</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP3_TX_DMA__UH_TX_DMA</name>
					<description> endpoint 3 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP4_TX_DMA</name>
			<description>endpoint 4 DMA TX buffer address</description>
			<addressOffset>0x68</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP4_TX_DMA</name>
					<description> endpoint 4 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP5_TX_DMA</name>
			<description>endpoint 5 DMA TX buffer address</description>
			<addressOffset>0x6C</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP5_TX_DMA</name>
					<description> endpoint 5 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP6_TX_DMA</name>
			<description>endpoint 6 DMA TX buffer address</description>
			<addressOffset>0x70</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP6_TX_DMA</name>
					<description> endpoint 6 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP7_TX_DMA</name>
			<description>endpoint 7 DMA TX buffer address</description>
			<addressOffset>0x74</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP7_TX_DMA</name>
					<description> endpoint 7 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP8_TX_DMA</name>
			<description>endpoint 8 DMA TX buffer address</description>
			<addressOffset>0x78</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP8_TX_DMA</name>
					<description> endpoint 8 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP9_TX_DMA</name>
			<description>endpoint 9 DMA TX buffer address</description>
			<addressOffset>0x7C</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP9_TX_DMA</name>
					<description> endpoint 9 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP10_TX_DMA</name>
			<description>endpoint 10 DMA TX buffer address</description>
			<addressOffset>0x80</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP10_TX_DMA</name>
					<description> endpoint 10 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP11_TX_DMA</name>
			<description>endpoint 11 DMA TX buffer address</description>
			<addressOffset>0x84</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP11_TX_DMA</name>
					<description> endpoint 11 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>

			<register>
			<name>UEP12_TX_DMA____UH_SPLIT_DATA</name>
			<description>endpoint 12 DMA TX buffer address</description>
			<addressOffset>0x88</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP12_TX_DMA___UH_SPLIT_DATA</name>
					<description> endpoint 12 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP13_TX_DMA</name>
			<description>endpoint 13 DMA TX buffer address</description>
			<addressOffset>0x8C</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP13_TX_DMA</name>
					<description> endpoint 13 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP14_TX_DMA</name>
			<description>endpoint 14 DMA TX buffer address</description>
			<addressOffset>0x90</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP14_TX_DMA</name>
					<description> endpoint 14 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP15_TX_DMA</name>
			<description>endpoint 15 DMA TX buffer address</description>
			<addressOffset>0x94</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP15_TX_DMA</name>
					<description> endpoint 15 DMA buffer address</description>
					<bitRange>[16:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>	
			<register>
			<name>UEP0_MAX_LEN</name>
			<description>endpoint 0 max acceptable length</description>
			<addressOffset>0X98</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP0_MAX_LEN</name>
					<description> endpoint 0 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP1_MAX_LEN</name>
			<description>endpoint 1 max acceptable length</description>
			<addressOffset>0X9C</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP1_MAX_LEN</name>
					<description> endpoint 1 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP2_MAX_LEN__UH_RX_MAX_LEN</name>
			<description>endpoint 2 max acceptable length</description>
			<addressOffset>0xA0</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP2_MAX_LEN__UH_RX_MAX_LEN</name>
					<description> endpoint 2 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP3_MAX_LEN</name>
			<description>endpoint 3 MAX_LEN TX </description>
			<addressOffset>0xA4</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP3_MAX_LEN</name>
					<description> endpoint 3 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP4_MAX_LEN</name>
			<description>endpoint 4 max acceptable length </description>
			<addressOffset>0xA8</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP4_MAX_LEN</name>
					<description> endpoint 4 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP5_MAX_LEN</name>
			<description>endpoint 5 max acceptable length</description>
			<addressOffset>0xAC</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP5_MAX_LEN</name>
					<description> endpoint 5 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP6_MAX_LEN</name>
			<description>endpoint 6 max acceptable length</description>
			<addressOffset>0xB0</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP6_MAX_LEN</name>
					<description> endpoint 6 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP7_MAX_LEN</name>
			<description>endpoint 7 max acceptable length</description>
			<addressOffset>0xB4</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP7_MAX_LEN</name>
					<description> endpoint 7 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP8_MAX_LEN</name>
			<description>endpoint 8 max acceptable length</description>
			<addressOffset>0xB8</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP8_MAX_LEN</name>
					<description> endpoint 8 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP9_MAX_LEN</name>
			<description>endpoint 9 max acceptable length</description>
			<addressOffset>0xBC</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP9_MAX_LEN</name>
					<description> endpoint 9 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP10_MAX_LEN</name>
			<description>endpoint 10 max acceptable length</description>
			<addressOffset>0xC0</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP10_MAX_LEN</name>
					<description> endpoint 10 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
			<register>
			<name>UEP11_MAX_LEN</name>
			<description>endpoint 11 max acceptable length</description>
			<addressOffset>0xC4</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP11_MAX_LEN</name>
					<description> endpoint 11 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>

			<register>
			<name>UEP12_MAX_LEN</name>
			<description>endpoint 12 max acceptable length</description>
			<addressOffset>0xC8</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
			<field>
			<name>UEP12_MAX_LEN</name>
					<description> endpoint 12 max acceptable length</description>
					<bitRange>[10:0]</bitRange>
					<access>read-write</access>
			</field>
			</fields>
			</register>
