ZhuYanzhen1/CH32V307/ch32v307.svd
					<register>
          <name>IPRIOR25</name>
          <displayName>IPRIOR25</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x419</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR26</name>
          <displayName>IPRIOR26</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x41A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR27</name>
          <displayName>IPRIOR27</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x41B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR28</name>
          <displayName>IPRIOR28</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x41C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR29</name>
          <displayName>IPRIOR29</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x41D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
		<register>
          <name>IPRIOR30</name>
          <displayName>IPRIOR30</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x41E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR31</name>
          <displayName>IPRIOR31</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x41F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR32</name>
          <displayName>IPRIOR32</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x420</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR33</name>
          <displayName>IPRIOR33</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x421</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR34</name>
          <displayName>IPRIOR34</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x422</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR35</name>
          <displayName>IPRIOR35</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x423</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR36</name>
          <displayName>IPRIOR36</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x424</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR37</name>
          <displayName>IPRIOR37</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x425</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR38</name>
          <displayName>IPRIOR38</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x426</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR39</name>
          <displayName>IPRIOR39</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x427</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
		<register>
          <name>IPRIOR40</name>
          <displayName>IPRIOR40</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x428</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR41</name>
          <displayName>IPRIOR41</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x429</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR42</name>
          <displayName>IPRIOR42</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x42A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR43</name>
          <displayName>IPRIOR43</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x42B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR44</name>
          <displayName>IPRIOR44</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x42C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR45</name>
          <displayName>IPRIOR45</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x42D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR46</name>
          <displayName>IPRIOR46</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x42E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR47</name>
          <displayName>IPRIOR47</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x42F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR48</name>
          <displayName>IPRIOR48</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x430</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR49</name>
          <displayName>IPRIOR49</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x431</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
	
			<register>
          <name>IPRIOR50</name>
          <displayName>IPRIOR50</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x432</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR51</name>
          <displayName>IPRIOR51</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x433</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR52</name>
          <displayName>IPRIOR52</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x434</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR53</name>
          <displayName>IPRIOR53</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x435</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR54</name>
          <displayName>IPRIOR54</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x436</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR55</name>
          <displayName>IPRIOR55</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x437</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR56</name>
          <displayName>IPRIOR56</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x438</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR57</name>
          <displayName>IPRIOR57</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x439</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR58</name>
          <displayName>IPRIOR58</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x43A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR59</name>
          <displayName>IPRIOR59</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x43B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>

				<register>
          <name>IPRIOR60</name>
          <displayName>IPRIOR60</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x43C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR61</name>
          <displayName>IPRIOR61</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x43D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR62</name>
          <displayName>IPRIOR62</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x43E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR63</name>
          <displayName>IPRIOR63</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x43F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR64</name>
          <displayName>IPRIOR64</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x440</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR65</name>
          <displayName>IPRIOR65</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x441</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR66</name>
          <displayName>IPRIOR66</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x442</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR67</name>
          <displayName>IPRIOR67</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x443</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR68</name>
          <displayName>IPRIOR68</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x444</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR69</name>
          <displayName>IPRIOR69</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x445</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
				<register>
          <name>IPRIOR70</name>
          <displayName>IPRIOR70</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x446</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR71</name>
          <displayName>IPRIOR71</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x447</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR72</name>
          <displayName>IPRIOR72</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x448</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR73</name>
          <displayName>IPRIOR73</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x449</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR74</name>
          <displayName>IPRIOR74</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x44A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR75</name>
          <displayName>IPRIOR75</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x44B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR76</name>
          <displayName>IPRIOR76</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x44C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR77</name>
          <displayName>IPRIOR77</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x44D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR78</name>
          <displayName>IPRIOR78</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x44E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR79</name>
          <displayName>IPRIOR79</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x44F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
				<register>
          <name>IPRIOR80</name>
          <displayName>IPRIOR80</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x450</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR81</name>
          <displayName>IPRIOR81</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x451</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR82</name>
          <displayName>IPRIOR82</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x452</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR83</name>
          <displayName>IPRIOR83</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x453</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR84</name>
          <displayName>IPRIOR84</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x454</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR85</name>
          <displayName>IPRIOR85</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x455</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR86</name>
          <displayName>IPRIOR86</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x456</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR87</name>
          <displayName>IPRIOR87</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x457</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR88</name>
          <displayName>IPRIOR88</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x458</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR89</name>
          <displayName>IPRIOR89</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x459</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
				<register>
          <name>IPRIOR90</name>
          <displayName>IPRIOR90</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x45A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR91</name>
          <displayName>IPRIOR91</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x45B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR92</name>
          <displayName>IPRIOR92</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x45C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR93</name>
          <displayName>IPRIOR93</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x45D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR94</name>
          <displayName>IPRIOR94</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x45E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR95</name>
          <displayName>IPRIOR95</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x45F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
