ZhuYanzhen1/CH32V307/ch32v307.svd
					<register>
          <name>IPRIOR96</name>
          <displayName>IPRIOR96</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x460</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR97</name>
          <displayName>IPRIOR97</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x461</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR98</name>
          <displayName>IPRIOR98</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x462</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR99</name>
          <displayName>IPRIOR99</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x463</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>	
				<register>
          <name>IPRIOR100</name>
          <displayName>IPRIOR100</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x464</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR101</name>
          <displayName>IPRIOR101</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x465</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR102</name>
          <displayName>IPRIOR102</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x466</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
				<register>
          <name>IPRIOR103</name>
          <displayName>IPRIOR103</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x467</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR104</name>
          <displayName>IPRIOR104</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x468</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR105</name>
          <displayName>IPRIOR105</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x469</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR106</name>
          <displayName>IPRIOR106</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x46A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR107</name>
          <displayName>IPRIOR107</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x46B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR108</name>
          <displayName>IPRIOR108</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x46C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR109</name>
          <displayName>IPRIOR109</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x46D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR110</name>
          <displayName>IPRIOR110</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x46E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
		<register>
          <name>IPRIOR111</name>
          <displayName>IPRIOR111</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x46F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR112</name>
          <displayName>IPRIOR112</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x470</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR113</name>
          <displayName>IPRIOR113</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x471</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR114</name>
          <displayName>IPRIOR114</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x472</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR115</name>
          <displayName>IPRIOR115</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x473</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR116</name>
          <displayName>IPRIOR16</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x474</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR117</name>
          <displayName>IPRIOR17</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x475</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR118</name>
          <displayName>IPRIOR18</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x476</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR119</name>
          <displayName>IPRIOR19</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x477</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR120</name>
          <displayName>IPRIOR120</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x478</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
		<register>
          <name>IPRIOR121</name>
          <displayName>IPRIOR121</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x479</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR122</name>
          <displayName>IPRIOR122</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x47A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR123</name>
          <displayName>IPRIOR123</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x47B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR124</name>
          <displayName>IPRIOR124</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x47C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR125</name>
          <displayName>IPRIOR125</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x47D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR126</name>
          <displayName>IPRIOR126</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x47E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR127</name>
          <displayName>IPRIOR127</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x47F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR128</name>
          <displayName>IPRIOR128</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x480</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR129</name>
          <displayName>IPRIOR129</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x481</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
		<register>
          <name>IPRIOR130</name>
          <displayName>IPRIOR130</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x482</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR131</name>
          <displayName>IPRIOR131</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x483</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR132</name>
          <displayName>IPRIOR132</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x484</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR133</name>
          <displayName>IPRIOR133</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x485</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR134</name>
          <displayName>IPRIOR134</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x486</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR135</name>
          <displayName>IPRIOR135</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x487</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR136</name>
          <displayName>IPRIOR136</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x488</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR137</name>
          <displayName>IPRIOR137</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x489</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR138</name>
          <displayName>IPRIOR138</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x48A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR139</name>
          <displayName>IPRIOR139</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x48B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
		<register>
          <name>IPRIOR140</name>
          <displayName>IPRIOR140</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x48C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR141</name>
          <displayName>IPRIOR141</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x48D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR142</name>
          <displayName>IPRIOR142</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x48E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR143</name>
          <displayName>IPRIOR143</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x48F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR144</name>
          <displayName>IPRIOR144</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x490</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR145</name>
          <displayName>IPRIOR145</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x491</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR146</name>
          <displayName>IPRIOR146</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x492</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR147</name>
          <displayName>IPRIOR147</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x493</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR148</name>
          <displayName>IPRIOR148</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x494</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR149</name>
          <displayName>IPRIOR149</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x495</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
	
			<register>
          <name>IPRIOR150</name>
          <displayName>IPRIOR150</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x496</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR151</name>
          <displayName>IPRIOR151</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x497</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR152</name>
          <displayName>IPRIOR152</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x498</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR153</name>
          <displayName>IPRIOR153</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x499</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR154</name>
          <displayName>IPRIOR154</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x49A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR155</name>
          <displayName>IPRIOR155</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x49B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR156</name>
          <displayName>IPRIOR156</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x49C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR157</name>
          <displayName>IPRIOR157</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x49D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR158</name>
          <displayName>IPRIOR158</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x49E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR159</name>
          <displayName>IPRIOR159</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x49F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>

				<register>
          <name>IPRIOR160</name>
          <displayName>IPRIOR160</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4A0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR161</name>
          <displayName>IPRIOR161</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4A1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR162</name>
          <displayName>IPRIOR162</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4A2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR163</name>
          <displayName>IPRIOR163</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4A3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR164</name>
          <displayName>IPRIOR164</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4A4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR165</name>
          <displayName>IPRIOR165</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4A5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR166</name>
          <displayName>IPRIOR166</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4A6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
