ZhuYanzhen1/CH32V307/ch32v307.svd
					<register>
          <name>IPRIOR167</name>
          <displayName>IPRIOR167</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4A7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR168</name>
          <displayName>IPRIOR168</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4A8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR169</name>
          <displayName>IPRIOR169</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4A9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
				<register>
          <name>IPRIOR170</name>
          <displayName>IPRIOR170</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4AA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR171</name>
          <displayName>IPRIOR171</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4AB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR172</name>
          <displayName>IPRIOR172</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4AC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR173</name>
          <displayName>IPRIOR173</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4AD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR174</name>
          <displayName>IPRIOR174</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4AE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR175</name>
          <displayName>IPRIOR175</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4AF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR176</name>
          <displayName>IPRIOR176</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR177</name>
          <displayName>IPRIOR177</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR178</name>
          <displayName>IPRIOR178</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR179</name>
          <displayName>IPRIOR179</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
				<register>
          <name>IPRIOR180</name>
          <displayName>IPRIOR180</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR181</name>
          <displayName>IPRIOR181</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR182</name>
          <displayName>IPRIOR182</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR183</name>
          <displayName>IPRIOR183</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR184</name>
          <displayName>IPRIOR184</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR185</name>
          <displayName>IPRIOR185</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4B9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR186</name>
          <displayName>IPRIOR186</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4BA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR187</name>
          <displayName>IPRIOR187</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4BB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR188</name>
          <displayName>IPRIOR188</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4BC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR189</name>
          <displayName>IPRIOR189</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4BD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
				<register>
          <name>IPRIOR190</name>
          <displayName>IPRIOR190</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4BE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR191</name>
          <displayName>IPRIOR191</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4BF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR192</name>
          <displayName>IPRIOR192</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR193</name>
          <displayName>IPRIOR193</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR194</name>
          <displayName>IPRIOR194</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR195</name>
          <displayName>IPRIOR195</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR196</name>
          <displayName>IPRIOR196</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR197</name>
          <displayName>IPRIOR197</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR198</name>
          <displayName>IPRIOR198</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR199</name>
          <displayName>IPRIOR199</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>	
				<register>
          <name>IPRIOR200</name>
          <displayName>IPRIOR200</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
		<register>
          <name>IPRIOR201</name>
          <displayName>IPRIOR201</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4C9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR202</name>
          <displayName>IPRIOR202</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4CA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
				<register>
          <name>IPRIOR203</name>
          <displayName>IPRIOR203</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4CB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR204</name>
          <displayName>IPRIOR204</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4CC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR205</name>
          <displayName>IPRIOR205</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4CD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR206</name>
          <displayName>IPRIOR206</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4CE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR207</name>
          <displayName>IPRIOR207</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4CF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR208</name>
          <displayName>IPRIOR208</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4D0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR209</name>
          <displayName>IPRIOR209</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4D1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR210</name>
          <displayName>IPRIOR210</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4D2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
		<register>
          <name>IPRIOR211</name>
          <displayName>IPRIOR211</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4D3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR212</name>
          <displayName>IPRIOR212</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4D4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR213</name>
          <displayName>IPRIOR213</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4D5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR214</name>
          <displayName>IPRIOR214</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4D6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR215</name>
          <displayName>IPRIOR215</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4D7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR216</name>
          <displayName>IPRIOR26</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4D8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR217</name>
          <displayName>IPRIOR27</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4D9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR218</name>
          <displayName>IPRIOR28</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4DA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR219</name>
          <displayName>IPRIOR29</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4DB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR220</name>
          <displayName>IPRIOR220</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4DC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
		<register>
          <name>IPRIOR221</name>
          <displayName>IPRIOR221</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4DD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR222</name>
          <displayName>IPRIOR222</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4DE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR223</name>
          <displayName>IPRIOR223</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4DF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR224</name>
          <displayName>IPRIOR224</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4E0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR225</name>
          <displayName>IPRIOR225</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4E1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR226</name>
          <displayName>IPRIOR226</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4E2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR227</name>
          <displayName>IPRIOR227</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4E3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR228</name>
          <displayName>IPRIOR228</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4E4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR229</name>
          <displayName>IPRIOR229</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4E5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
		<register>
          <name>IPRIOR230</name>
          <displayName>IPRIOR230</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4E6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR231</name>
          <displayName>IPRIOR231</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4E7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR232</name>
          <displayName>IPRIOR232</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4E8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR233</name>
          <displayName>IPRIOR233</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4E9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR234</name>
          <displayName>IPRIOR234</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4EA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR235</name>
          <displayName>IPRIOR235</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4EB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR236</name>
          <displayName>IPRIOR236</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4EC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR237</name>
          <displayName>IPRIOR237</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4ED</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
