ZhuYanzhen1/CH32V307/ch32v307.svd
					<register>
          <name>IPRIOR238</name>
          <displayName>IPRIOR238</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4EE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR239</name>
          <displayName>IPRIOR239</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4EF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
		<register>
          <name>IPRIOR240</name>
          <displayName>IPRIOR240</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4F0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR241</name>
          <displayName>IPRIOR241</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4F1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR242</name>
          <displayName>IPRIOR242</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4F2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR243</name>
          <displayName>IPRIOR243</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4F3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR244</name>
          <displayName>IPRIOR244</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4F4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR245</name>
          <displayName>IPRIOR245</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4F5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR246</name>
          <displayName>IPRIOR246</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4F6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR247</name>
          <displayName>IPRIOR247</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4F7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
					<register>
          <name>IPRIOR248</name>
          <displayName>IPRIOR248</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4F08</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR249</name>
          <displayName>IPRIOR249</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4F9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
	
			<register>
          <name>IPRIOR250</name>
          <displayName>IPRIOR250</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4FA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR251</name>
          <displayName>IPRIOR251</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4FB</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR252</name>
          <displayName>IPRIOR252</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4FC</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR253</name>
          <displayName>IPRIOR253</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4FD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
			<register>
          <name>IPRIOR254</name>
          <displayName>IPRIOR254</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4FE</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		<register>
          <name>IPRIOR255</name>
          <displayName>IPRIOR255</displayName>
          <description>Interrupt Priority Register</description>
          <addressOffset>0x4FF</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
		
			<register>
          <name>SCTLR</name>
          <displayName>SCTLR</displayName>
          <description>System Control Register</description>
          <addressOffset>0xd10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SLEEPONEXIT</name>
              <description>SLEEPONEXIT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			 <field>
              <name>SLEEPDEEP</name>
              <description>SLEEPDEEP</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			 <field>
              <name>WFITOWFE</name>
              <description>WFITOWFE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
		  <field>
              <name>SEVONPEND</name>
              <description>SEVONPEND</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>SETEVENT</name>
              <description>SETEVENT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>SYSRESET</name>
              <description>SYSRESET</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
		<register>
          <name>STK_CTLR</name>
          <displayName>STK_CTLR</displayName>
          <description>System counter control register</description>
          <addressOffset>0x1000</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STE</name>
              <description>System counter  enable</description>
			  <access>read-write</access>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>STIE</name>
              <description>System counter interrupt enable</description>
			  <access>read-write</access>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			 <field>
              <name>STCLK</name>
              <description>System selects the clock source</description>
			  <access>read-write</access>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>STRE</name>
              <description>System reload register</description>
			  <access>read-write</access>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>MODE</name>
              <description>System Mode</description>
			  <access>read-write</access>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>INIT</name>
              <description>System Initialization update</description>
			  <access>read-write</access>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
			<field>
              <name>SWIE</name>
              <description>System software triggered interrupts enable</description>
			  <access>read-write</access>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register> 
	<register>
          <name>STK_SR</name>
          <description>System START</description>
          <addressOffset>0x1004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNTIF</name>
              <description>CNTIF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register> 
    <register>
          <name>STK_CNTL</name>
          <description>System counter low register</description>
          <addressOffset>0x1004</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNTL</name>
              <description>CNTL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>   
    <register>
          <name>STK_CNTH</name>
          <description>System counter high register</description>
          <addressOffset>0x1008</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNTH</name>
              <description>CNTH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register> 
    <register>
          <name>STK_CMPLR</name>
          <description>System compare low register</description>
          <addressOffset>0x100C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMPL</name>
              <description>CMPL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>    
        <register>
          <name>STK_CMPHR</name>
          <description>System compare high register</description>
          <addressOffset>0x1010</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMPH</name>
              <description>CMPH</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>        
		</registers>
		</peripheral>
	</peripherals>
 </device>
